Repository: Maxim-Sedykh/OrderPaymentSystem
Catalog: src/Core/OrderPaymentSystem.Domain/Resources/ErrorMessage.*.resx
Languages: ru

# BasketItemNotFound
source: Basket item with Id {0} not found
ru: Элемент корзины с Id {0} не найден

# ConcurrencyConflict
source: The record was modified by another user. Please try again.
ru: Запись была обновлена другим пользователем, попробуйте ещё раз

source: Internal server error
ru: Внутренняя ошибка сервера

source: invalid client request
ru: Не валидный запрос клиента

source: invalid token
ru: Не валидный токен

source: No changes found
ru: Изменений не найдено

# NotEnoughPayFunds
source: There are not enough funds to pay
ru: Не хватает средств для оплаты

# OrderCannotAddOrRemoveItemInCurrentStatus
source: Impossible to change order items in order with status {0}
ru: Нельзя менять элементы товара в статусе {0}

# OrderCannotBeConfirmed
source: Order cannot be confirmed: current status is {0}
ru: Заказ не может быть подтверждён. Текущий статус {0}

# OrderCannotBeConfirmedWithoutPayment
source: Order сannot be confirmed without completed payment
ru: Заказ не может быть подтверждён без законченного платежа

# OrderCannotBeShipped
source: Order cannot be shipped: {0}
ru: Заказ не может быть доставлен по причине {0}

# OrderCannotRemoveNonExistingItem
source: Cannot remove item that does not exist in the order
ru: Нельзя удалить несуществующий элемент заказа из заказа

# OrderDeliveryAddressRequired
source: Delivery address is required
ru: Для заказа необходимо указать адрес доставки

# OrderItemNotFound
source: Order item with id {0} not found
ru: Элемент заказа c Id {0} не найден

# OrderItemsEmpty
source: Order must contain at least one item
ru: Заказ должен содержать хотя бы один элемент

# OrderNotFound
source: Order with id {0} is not found
ru: Заказ с Id {0} не найден

# OrderStatusChangeNotAllowed
source: Cannot change order status from {0} to {1}
ru: Нельзя поменять статус заказа с {0} на {1}

# PasswordHashCannotBeEmpty
source: Password cannot be empty
ru: Пароль не должен быть пустым

# InvalidCredentials
source: Invalid user data
ru: Неверные данные пользователя

source: Password not equals password confirm
ru: Пароли не равны

# PaymentAlreadyExistsForOrder
source: Payment is already exists for order with Id {0}
ru: Платёж уже существует для заказа с Id {0}

# PaymentAmountPositive
source: Amount to pay must be positive
ru: Сумма платежа должна быть положительной

# PaymentCashChangeMismatch
source: Cash change calculation mismatch
ru: Несоответствие сдачи в платеже

# PaymentInvalidStatus
source: Impossible to change status of payment from {0} to {1}
ru: Невозможно поменять статус платежа с {0} на {1}

# PaymentNotEnoughAmount
source: Amount paid {0} is less than amount to pay {1}
ru: Сумма платежа {0} меньше чем нужно заплатить {1}

# PaymentNotFound
source: Payment with id {0} is not found
ru: Платёж с Id {0} не найден

# PaymentOrderNotAssociated
source: Payment not associated with order
ru: Платёж не связан с заказом

# PaymentsNotFound
source: Payments is not found
ru: Платежы не найдены

# ProductAlreadyExist
source: Product with name {0} already exist
ru: Товар с названием {0} уже существует

# ProductNameEmpty
source: Product name cannot be empty
ru: Название товара должно быть не пустым

# ProductNotFound
source: Product with Id {0} not found
ru: Товар с Id {0} не найден

# ProductPricePositive
source: Product price must be positive
ru: У товара должна быть положительная цена

# ProductsNotFound
source: Products is not found
ru: Товары не найдены

# ProductStockQuantityNotAvailable
source: Requested quantity {0} for product {1} is not available in stock
ru: Запрошенное количество товара{0} для товара с Id {1} недоступно.

# QuantityPositive
source: Quantity must be positive
ru: Количество товара должно быть не отрицательным

# RefreshTokenExpired
source: Refresh token is expired
ru: Время жизни токена истекло

# RefreshTokenFuture
source: Refresh token expiration must be in the future
ru: Время истечения жизни токена должно быть в будущем

# RoleAlreadyExist
source: Role with this name {0} is already exist
ru: Роль с таким названием {0} уже существует

source: Role name cannot be empty
ru: Название роли не может быть пустым

# RoleNotFoundById
source: Role with id {0} is not found
ru: Роль c id {0} не найдена

# RoleNotFoundByName
source: Role with name {0} is not found
ru: Роль с названием {0} не найдена

# RolesNotFound
source: Roles is not found
ru: Роли не найдены

# StockQuantityPositive
source: Stock quantity must be positive
ru: Количество товара на складе не может быть отрицательным

# UserAlreadyExist
source: User already exist with login {0}
ru: Пользователь c логином {0} уже существует

# UserAlreadyExistThisRole
source: User already has the role {0}.
ru: Пользователь с ролью у которой Id {0} уже существует

# UserNotFoundById
source: User with id {0} is not found
ru: Пользователь с Id {0} не найден

# UserNotFoundByLogin
source: User with login {0} is not found
ru: Пользователь с логином {0} не найден

# UserRolesNotFound
source: User with id {0} has no assigned roles.
ru: У пользователя с Id {0} нет ролей

# UserRoleNotFound
source: User has not role with id {0}
ru: У пользователя роль с Id {0} не найдена

source: Order cannot be shipped without payment
ru: Заказ не может быть доставлен без
